       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENTAHI1.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO ENTRADA.
           SELECT SALIDA  ASSIGN TO SALIDA.
       DATA DIVISION.
       FILE SECTION.
       FD  ENTRADA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 18 CHARACTERS
           DATA RECORD IS REG-ENTRADA.
       01 REG-ENTRADA.
           02 CLAVE.
             03 S-COD-ANYO       PIC X(4).
             03 S-COD-VENDEDOR   PIC 9(4).
             03 S-COD-PRODUCTO   PIC 9(4).
           02 S-KILOS       PIC 9(4)V99.
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 17 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA.
           02 SAL-CLAVE  PIC X(12).
           02 SAL-KILOS  PIC 9(7)V99  COMP-3.
       WORKING-STORAGE SECTION.
       77  FF PIC X.
       77  W-CLAVE         PIC X(12).
       77  W-COD-PRODUCTO  PIC 9(4).
       77  WKILOS          PIC 9(7)V99.
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT ENTRADA
           OPEN OUTPUT SALIDA
           MOVE 0 TO FF
           READ ENTRADA AT END MOVE 1 TO FF END-READ
           PERFORM  UNTIL FF = 1
              MOVE CLAVE  TO W-CLAVE
              PERFORM  UNTIL CLAVE NOT = W-CLAVE OR  FF = 1
                 ADD  S-KILOS TO WKILOS
                 READ ENTRADA AT END MOVE 1 TO FF END-READ
              END-PERFORM
           MOVE W-CLAVE TO SAL-CLAVE
           MOVE WKILOS TO SAL-KILOS
           WRITE REG-SALIDA END-WRITE
           MOVE 0 TO WKILOS
           END-PERFORM
           CLOSE ENTRADA SALIDA
           STOP RUN.
