       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENTAS2.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO ENTRADA.
           SELECT SALIDA  ASSIGN TO SALIDA.
           SELECT FPRODUC ASSIGN TO FPRODUC
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS FPRODUC-CLAVE.
           SELECT FVENDED ASSIGN TO FVENDED
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS FVENDED-CLAVE.
       DATA DIVISION.
       FILE SECTION.
       FD  ENTRADA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 19 CHARACTERS
           DATA RECORD IS REG-ENTRADA.
       01 REG-ENTRADA.
           03 CLAVE.
             05 S-A    PIC 9(4).
             05 S-COD-VENDEDOR   PIC 9(4).
             05 S-COD-PRODUCTO  PIC 9(4).
           03 S-M    PIC 99.
           03 S-KILOS       PIC 9(7)V99 COMP-3.
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 172 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA PIC X(172).
       FD  FVENDED
           RECORD 153 CHARACTERS
           DATA RECORD IS REG-FVENDED.
       01 REG-FVENDED.
           02 REG-ENT.
              03 FVENDED-CLAVE PIC X(4).
              03 FILLER PIC X(149).
           02 TODO REDEFINES REG-ENT.
             03 FVENDED-COD-VENDEDOR PIC 9(4).
             03 FVENDED-NOMBRE PIC X(30).
             03 FVENDED-FECHA-ALTA.
                 05 FVENDED-A-A PIC X(4).
                 05 FVENDED-M-A PIC XX.
                 05 FVENDED-D-A PIC XX.
             03 FVENDED-NIF    PIC X(10).
             03 FVENDED-FECHA-NACIMIENTO.
                 05 FVENDED-A-N PIC X(4).
                 05 FVENDED-M-N PIC XX.
                 05 FVENDED-D-N PIC XX.
             03 FVENDED-DIRECION PIC X(30).
             03 FVENDED-POBLACION PIC X(30).
             03 FVENDED-COD-POSTAL PIC X(10).
             03 FVENDED-TELEFONO PIC X(10).
             03 FVENDED-ESTADO PIC X(12).
             03 FVENDED-GUAPO  PIC X.
       FD  FPRODUC
           RECORD 30 CHARACTERS
           DATA RECORD IS REG-FPRODUC.
       01 REG-FPRODUC.
             02 NADA.
               03 FPRODUC-CLAVE PIC X(4).
               03 FILLER PIC X(26).
             02 TODO REDEFINES NADA.
                03 S-IDPRODUCTO   PIC 9(4).
                03 S-NOMPRODUCTO  PIC X(20).
                03 S-IDGRUPO      PIC 99.
                03 S-PRECIO       PIC 9(2)V99.
       WORKING-STORAGE SECTION.
       77  FE PIC X.
       77  ANYO PIC 9999.
       77  A  PIC 99.
       77  W-COD-VENDEDOR  PIC 9(4).
       77  W-COD-PRODUCTO  PIC 9(4).
       77  WTAB-PROD-FIN PIC 99.
       77  WTAB-VEND-FIN PIC 99.
       77  WTAB-PROD-NEXT PIC 99 VALUE 1.
       77  WTAB-VEND-NEXT PIC 99 VALUE 1.
       01  FILLER.
           02 WKILOS PIC 9(6)V99 OCCURS 12.
           02 WTAB-PROD PIC X(30) OCCURS 20.
           02 WTAB-VEND PIC X(30) OCCURS 20.
       01  CABECERA1.
           03 FILLER PIC X(11)   VALUE 'VENDEDOR   '.
           03 CAB-COD-VENDEDOR   PIC ZZZ9.
           03 FILLER         PIC XX VALUE SPACES.
           03 CAB-NOM-VENDEDOR   PIC X(30).
       01  CABECERA2.
           03 FILLER PIC X(4)   VALUE  'COD.'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(20)   VALUE  '   PRODUCTO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '   ENERO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '  FEBRERO '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '   MARZO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '   ABRIL  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '   MAYO   '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '  JUNIO   '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '  JULIO   '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '  AGOSTO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  'SEPTIEMBRE'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  '  OCTUBRE '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  'NOVIEMBRE '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  'DICIEMBRE'.
       01  CABECERA22.
           03 FILLER PIC X(4)   VALUE  ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(20)   VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE   ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE  ALL '-'.
       01  CABECERA3.
           03 CAB-COD-PRODUCTO   PIC ZZZ9.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 CAB-NOM-PRODUCTO   PIC X(22).
           03 FILLER          OCCURS 12.
              05 CAB-KILOS      PIC ZZZZZZ9,99.
              05 FILLER PIC X(2) VALUE SPACES.
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT ENTRADA FVENDED FPRODUC
           OPEN OUTPUT SALIDA
           ACCEPT ANYO
           PERFORM LLENAR-TABLAS
           MOVE 0 TO FE
           READ ENTRADA AT END MOVE 1 TO FE END-READ
           PERFORM UNTIL S-A = ANYO OR FE = 1
             READ ENTRADA AT END MOVE 1 TO FE END-READ
           END-PERFORM
           PERFORM  UNTIL S-A NOT = ANYO OR FE = 1
              MOVE S-COD-VENDEDOR TO W-COD-VENDEDOR
              PERFORM UNTIL W-COD-VENDEDOR  =  WTAB-VEND-NEXT
                 MOVE WTAB-VEND(WTAB-VEND-NEXT) TO CAB-NOM-VENDEDOR
                 MOVE WTAB-VEND-NEXT TO  CAB-COD-VENDEDOR
                 PERFORM IMPRIMIR-CABECERA
                 ADD 1 TO  WTAB-VEND-NEXT
                 PERFORM UNTIL WTAB-PROD-NEXT > WTAB-PROD-FIN
                   MOVE WTAB-PROD(WTAB-PROD-NEXT) TO CAB-NOM-PRODUCTO
                   MOVE WTAB-PROD-NEXT TO  CAB-COD-PRODUCTO
                   PERFORM IMPRIMIR-LINEA-PRODUCTO
                   ADD 1 TO  WTAB-PROD-NEXT
                 END-PERFORM
               END-PERFORM
               MOVE WTAB-VEND(W-COD-VENDEDOR) TO CAB-NOM-VENDEDOR
               MOVE W-COD-VENDEDOR  TO  CAB-COD-VENDEDOR
               ADD 1 TO  WTAB-VEND-NEXT
               PERFORM IMPRIMIR-CABECERA
               PERFORM  UNTIL S-COD-VENDEDOR NOT = W-COD-VENDEDOR OR
                         FE = 1
                  MOVE S-COD-PRODUCTO TO W-COD-PRODUCTO
               PERFORM RESET-WKILOS
               PERFORM UNTIL W-COD-PRODUCTO  =  WTAB-PROD-NEXT
                 MOVE WTAB-PROD(WTAB-PROD-NEXT) TO CAB-NOM-PRODUCTO
                 MOVE WTAB-PROD-NEXT TO  CAB-COD-PRODUCTO
                 PERFORM IMPRIMIR-LINEA-PRODUCTO
                 ADD 1 TO  WTAB-PROD-NEXT
               END-PERFORM
               PERFORM  UNTIL S-COD-VENDEDOR NOT = W-COD-VENDEDOR OR
                       S-COD-PRODUCTO NOT = W-COD-PRODUCTO OR FE = 1
                      ADD  S-KILOS TO WKILOS(S-M)
                      READ ENTRADA AT END MOVE 1 TO FE END-READ
               END-PERFORM
               MOVE WTAB-PROD(W-COD-PRODUCTO) TO CAB-NOM-PRODUCTO
               MOVE W-COD-PRODUCTO TO  CAB-COD-PRODUCTO
               PERFORM IMPRIMIR-LINEA-PRODUCTO
               ADD 1 TO  WTAB-PROD-NEXT
             END-PERFORM
               PERFORM RESET-WKILOS
               PERFORM UNTIL WTAB-PROD-NEXT > WTAB-PROD-FIN
                 MOVE WTAB-PROD(WTAB-PROD-NEXT) TO CAB-NOM-PRODUCTO
                 MOVE WTAB-PROD-NEXT TO  CAB-COD-PRODUCTO
                 PERFORM IMPRIMIR-LINEA-PRODUCTO
                 ADD 1 TO  WTAB-PROD-NEXT
               END-PERFORM
               MOVE SPACES TO REG-SALIDA
               WRITE REG-SALIDA    END-WRITE
           END-PERFORM
               PERFORM RESET-WKILOS
               PERFORM UNTIL WTAB-VEND-NEXT > WTAB-VEND-FIN
                 MOVE WTAB-VEND(WTAB-VEND-NEXT) TO CAB-NOM-VENDEDOR
                 MOVE WTAB-VEND-NEXT TO  CAB-COD-VENDEDOR
                 PERFORM IMPRIMIR-LINEA-VENDEDOR
                 ADD 1 TO  WTAB-VEND-NEXT
               END-PERFORM
               PERFORM UNTIL WTAB-PROD-NEXT > WTAB-PROD-FIN
                 MOVE WTAB-PROD(WTAB-PROD-NEXT) TO CAB-NOM-PRODUCTO
                 MOVE WTAB-PROD-NEXT TO  CAB-COD-PRODUCTO
                 PERFORM IMPRIMIR-LINEA-PRODUCTO
                 ADD 1 TO  WTAB-PROD-NEXT
               END-PERFORM
           CLOSE ENTRADA SALIDA FVENDED FPRODUC
           STOP RUN.
       IMPRIMIR-CABECERA.
           MOVE 1 TO WTAB-PROD-NEXT
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           WRITE REG-SALIDA FROM CABECERA22 END-WRITE.
       IMPRIMIR-LINEA-PRODUCTO.
           PERFORM  VARYING A FROM 1 BY 1 UNTIL A > 12
               MOVE  WKILOS(A)  TO CAB-KILOS(A)
           END-PERFORM
           WRITE REG-SALIDA FROM CABECERA3 END-WRITE.
       RESET-WKILOS.
           PERFORM  VARYING A FROM 1 BY 1 UNTIL A > 12
             MOVE 0 TO WKILOS(A)
           END-PERFORM.
       LLENAR-TABLAS.
           MOVE  0 TO FE A
           READ FPRODUC  AT END MOVE 1 TO FE  END-READ
           PERFORM UNTIL FE = 1
              ADD 1 TO A
              MOVE S-NOMPRODUCTO  TO WTAB-PROD(A)
              READ FPRODUC  AT END MOVE 1 TO FE  END-READ
           END-PERFORM
           MOVE A TO WTAB-PROD-FIN
           MOVE  0 TO FE A
           READ FVENDED  AT END MOVE 1 TO FE  END-READ
           PERFORM UNTIL FE = 1
              ADD 1 TO A
              MOVE FVENDED-NOMBRE TO WTAB-VEND(A)
              READ FVENDED  AT END MOVE 1 TO FE  END-READ
           END-PERFORM
           MOVE A TO WTAB-VEND-FIN.
       IMPRIMIR-LINEA-VENDEDOR.
           MOVE 1 TO WTAB-PROD-NEXT
           MOVE WTAB-VEND(WTAB-VEND-NEXT) TO CAB-NOM-VENDEDOR
           MOVE WTAB-VEND-NEXT TO  CAB-COD-VENDEDOR
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           WRITE REG-SALIDA FROM CABECERA22 END-WRITE.
